In [1]:
import pandas as pd
import numpy as np

In [7]:
a=pd.DataFrame(data=np.ones(shape=(3,3)))
a

     0    1    2
0  1.0  1.0  1.0
1  1.0  1.0  1.0
2  1.0  1.0  1.0

In [8]:
b=pd.DataFrame(data=np.ones(shape=(3,3))*2)
b

     0    1    2
0  2.0  2.0  2.0
1  2.0  2.0  2.0
2  2.0  2.0  2.0

# 加法 乘法

In [9]:
a+b # 或a.add(b)

     0    1    2
0  3.0  3.0  3.0
1  3.0  3.0  3.0
2  3.0  3.0  3.0

In [15]:
a*b # 或 a.mul(b)  a.multiply(b)

     0    1    2
0  2.0  2.0  2.0
1  2.0  2.0  2.0
2  2.0  2.0  2.0

In [18]:
c=pd.DataFrame(data=np.ones(shape=(3,2)))
c

     0    1
0  1.0  1.0
1  1.0  1.0
2  1.0  1.0

In [25]:
c.shape

(3, 2)

In [19]:
d=pd.DataFrame(data=np.ones(shape=(2,3)))
d

     0    1    2
0  1.0  1.0  1.0
1  1.0  1.0  1.0

In [21]:
c.dot(d)  # 或 c@d

     0    1    2
0  2.0  2.0  2.0
1  2.0  2.0  2.0
2  2.0  2.0  2.0

In [26]:
e=pd.DataFrame(data=np.ones(shape=(3,1)))
e

     0
0  1.0
1  1.0
2  1.0

In [31]:
e.count()[0]

3

0    3
1    3
dtype: int64